In [2]:
import pandas as pd
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
        'age': [20, 19, 22, 21],
        'favorite_color': ['blue', 'red', 'yellow', "green"],
        'grade': [88, 92, 95, 70]}
df = pd.DataFrame(raw_data, index = ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'])
df

                              name  age favorite_color  grade
Willard Morris      Willard Morris   20           blue     88
Al Jennings            Al Jennings   19            red     92
Omar Mullins          Omar Mullins   22         yellow     95
Spencer McDaniel  Spencer McDaniel   21          green     70

In [14]:
a=[]
b=30
a.append(b)
a

[30]

In [15]:
a.append(b)
a.append(b)
a.append(b)
a

[30, 30, 30, 30]

In [16]:
df['My new column'] = a
df

                              name  age favorite_color  grade  My new column
Willard Morris      Willard Morris   20           blue     88             30
Al Jennings            Al Jennings   19            red     92             30
Omar Mullins          Omar Mullins   22         yellow     95             30
Spencer McDaniel  Spencer McDaniel   21          green     70             30

In [17]:
len(df.index)

4

In [18]:
for index, row in df.iterrows():
    print (row["name"], row["age"])

Willard Morris 20
Al Jennings 19
Omar Mullins 22
Spencer McDaniel 21